#include <iostream>
using namespace std;
int main(){
	setlocale(LC_ALL, "rus");
	//1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
	/*int s;
	for (int i = 10; i <= 20; i = i + 1){
		s = i * i;
		cout << s << " ";
	}*/
	//2. Составьте программу, котораЯ вычисляет сумму чисел от 1 до n.значение n вводится с клавиатуры.
	/*int s, n;
	cin >> n;
	s = 0;
	for (int i = 1; i <= n; i = i + 1) {
		s = s + i;
	}
	cout << s << " ";*/
	//3. Составьте программу, составьте программу, которая вычисляет произведение чисел от 1 до n.n вводится с клавиатуры.
	/*int s, n;
	cin >> n;
	s = 1;
	for (int i = 1; i <= n; i = i + 1) {
		s = s * i;
	}
	cout << s << " ";*/
	//4. С клавиатуры вводятся n чисел.
	//Составьте программу, которая определяет кол-во отрицательных,
	//кол-во положительных и кол-во нулей среди введеных чисел.Значение n вводится с клавиатуры.
	//int p = 0, o = 0, nu = 0, n;  //p - положительное, o - отрицательное, nu - нулевое.
	//cin >> n;
	//int x;
	//for (int i = 1; i <= n; i = i + 1) {
	//	cin >> x;
	//	if (x == 0) {
	//		nu++;
	//	}
	//	else if (x > 0) {
	//		p++;
	//	}
	//	else if (x < 0) {
	//		o++;
	//	}
	//}
	//	cout << "Нулей - " << nu << "  " << "Положительных - " << p << "  " << "Отрицательных - " << o << "  ";
}